[
  {
    "title": "The Takbir of the Tongue & Heart During the Ten Days of Dhil Hijjah – Shaykh Saleh Sindi حفظه الله [Video|Ar-En Subtitles]",
    "author": "Shaykh Saleh Sindi حفظه الله",
    "translator": "",
    "category": "Dhikr (Remembrance), Dhul-Hijjah, Hajj",
    "content": "The Takbir of the Tongue & Heart During the Ten Days of Dhil Hijjah – Shaykh Saleh Sindi حفظه الله\n\nhttps://youtu.be/u1LD6Yvgab0\n\n[17 min] – Arabic | English Subtitles\n\nBlessed Days [First 10 Days of Dhul Hijjah]\n\nhttps://abdurrahman.org/hajj/blessed-days-first-10-days-of-dhul-hijjah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/06/08/the-takbir-of-the-tongue-heart-during-the-ten-days-of-dhil-hijjah/",
    "language": "en"
  },
  {
    "title": "The Effects of Hajj in Purifying One’s Aqidah | Shaykh Abdurrazzaq al-Badr حفظه الله [Video| Ar-En Subtitles]",
    "author": "The Effects of Hajj in Purifying One’s Aqidah | Shaykh Abdurrazzaq al-Badr حفظه الله",
    "translator": "",
    "category": "Hajj, Islam",
    "content": "Subscribe to Scholarly Subtitles Youtube Channel:\n\nhttps://www.youtube.com/@Scholarly_Subtitles",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/06/03/the-effects-of-hajj-in-purifying-ones-aqidah/",
    "language": "en"
  },
  {
    "title": "Lowering the Gaze & the Sweetness of Iman – Shaykh Abdussalam al Shuwayir حفظه الله [Video|Ar-En subtitles]",
    "author": "Shaykh Abdussalam al Shuwayir حفظه الله",
    "translator": "",
    "category": "Heart, Islam, Major Sins, Private Parts, Sins",
    "content": "Lowering the Gaze & the Sweetness of Iman\n\nShaykh Abdussalam al Shuwayir حفظه الله [Video|Ar-En subtitles]\n\nhttps://www.youtube.com/watch?v=qzyStw-uOMg\n\n[4 min]\n\nThe Prophet (ﷺ) said: “\n\nO youth, whoever amongst you is able to get married, then get married\n\n”. And this shows us the emphasis of performing this action and it is from the affairs that are pleasing to Allah. Indeed, it helps lower the gaze and protects the private parts.\n\nLowering the gaze, O noble brothers, is from the affairs that Allah commanded us with in His Book. Allah says addressing the men: “\n\nTell the believing men to lower their gaze (from looking at forbidden things), and protect their private parts.”\n\n(Al-Nur: 30) Then He addresses the women and says: “\n\nTell the believing women to lower their gaze (from looking at forbidden things), and protect their private parts.”\n\n(Al-Nur:31)\n\nThis lowering of the gaze is from the affairs that has a\n\nplace in the heart.\n\nDue to this Allah (ﷻ) coupled the lowering of the gaze with the action of the heart. Allah said: “\n\nAllah knows the fraud of the eyes, and all that the breasts conceal.\n\n” (Al-Ghafir:19) Therefore, you might be walking with your friend and you might look at something while he doesn’t know what you are looking at. And perhaps you might sneak a glance at something that is prohibited and he doesn’t know what it is you are looking at.\n\nTherefore, it is stated in the Hadith that is with Ahmad and al-Hakim, the Hadith of Ibn Mas’ud, that the Prophet (ﷺ) said: “\n\nWhoever lowers his gaze from what Allah prohibits, while he is able to look at it, wanting what is with Allah (ﷻ), He will place in his heart the sweetness of Iman”\n\n.\n\nAnd the people of knowledge say that\n\nthe reason for the sweetness of Iman,\n\nafter the Tawhid of Allah (ﷻ) and making one’s worship sincerely for Him, by freeing the heart from being attached to other than Him, is giving concern to those acts of worship done in secret. Therefore, an individual will not find an act of worship whereby he tastes the sweetness of Iman like the night prayer and spending in secret because only Allah (ﷻ) knows when one spends his wealth in secret. And wealth possesses sweetness and love in the heart. And from them is lowering the gaze and restraint.\n\nDuring these times, lowering the gaze has become from the difficult affairs. An individual can be in his home with the doors closed and curtains drawn. And no one knows anything about him except Allah (ﷻ). Then he looks at his phone or at the screen in front of him. So he is looking at matters that are prohibited that no one else can see. However, if he remembers what is with Allah (ﷻ), and then he lowers his gaze hoping for what is with Allah (ﷻ), then let him rejoice because he will taste the sweetness of Iman. This is what the Prophet (ﷺ) said.\n\nMany people say: I heard that Sufyan said that ‘there is a tremendous sweetness in seeking knowledge’, but I don’t experience it. And I heard that Ibrahim Ibn Adh’ham said that ‘there is a pleasure in the night prayer, if the children of the kings knew, they would fight us for it with their swords’, but I don’t experience it. And I heard that Abdullah Ibn Zubayr said that when he would stand for his prayer, he would be so preoccupied with his worship that he wouldn’t know who was beside him, to the extent that a hornet would come to him and sting him several times and he still wouldn’t move. Then he would say: I was preoccupied from it.\n\nAnd in the Sunan of Abi Dawud, one of the companions would be shot by an arrow and he didn’t break his prayer saying: I was reading a Surah that is more beloved to me than the worldly life and all that is in it.\n\nThese affairs benefitted these people, but we don’t experience in our hearts what they experienced, due to two reasons that I mentioned to you earlier which is the issue of the actions of the heart, being attached to Allah (ﷻ), from negating partners and making one’s worship sincere. And from the types of making one’s worship sincerely for Allah is the sincerity of the actions of the heart. So you don’t rely upon, nor seek aid from, nor hope from, nor fear except Allah (ﷻ). And the second affair is giving concern to the\n\nacts of worship that are done in secret.\n\nAnd the Shaykh Taqi al-Din has a priceless statement regarding the acts of worship done in secret that he included in his book al-Istiqamah. And how it is that everyone has a door regarding acts of worship done in secret opened for him that are not opened for others. Therefore, giving concern to the acts of worship done in secret is important, in agreement to the statement of the Prophet (ﷺ): Indeed, it helps lower the gaze… Along with striving against the soul, the individual takes the means and from them is marriage.",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/08/22/lowering-the-gaze-the-sweetness-of-iman/",
    "language": "en"
  },
  {
    "title": "If Satan whispers to you, burn him with these ten protections — he will never come near you again [Video|Ar-En subtitles]",
    "author": "",
    "translator": "",
    "category": "Islam, Jinn & Shaytan (Devil)",
    "content": "If Satan whispers to you, burn him with these ten protections — he will never come near you again | [Video | En subtitles] –\n\nhttps://youtu.be/gAA4Pj9Joys?si\n\n[3:26 min]\n\nOne of the most important things a Muslim should pay attention to in this context is taking care of the protective measures against Satan — and the most important and greatest of these are ten protections.\n\n[1]\n\nSeeking refuge in Allah from him.\n\nSeeking refuge means taking shelter with Allah and turning to Him, Exalted be He. The greatest evil from which one seeks refuge in Allah is the evil of Satan. Allah the Almighty said: ‘And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.’\n\n[2]\n\nReciting the Mu’awwidhatayn.\n\nThese are the two chapters of refuge: “Say, I seek refuge in the Lord of daybreak” (\n\nSurah Al-Falaq\n\n) and “Say, I seek refuge in the Lord of mankind” (\n\nSurah An-Nas\n\n). It is authentically reported from our Prophet that he said: ‘No one seeks refuge with anything better than them.’ He used to seek refuge with them every night when he went to bed. It is also authentically reported that whoever recites them along with Surah Al-Ikhlas three times in the morning and three times in the evening\n\nwill be protected from all evil.\n\n[3]\n\nReciting Ayat al-Kursi when one goes to bed to sleep.\n\nIt holds great significance in protecting against Satan, driving him away, and keeping him out of the place. It is authentically reported in Sahih sources from our Prophet that whoever recites it when going to bed will have a guardian from Allah over him, and no devil will come near him until morning.\n\n[4]\n\nReciting Surah Al-Baqarah in its entirety\n\n. It has an incredibly powerful and amazing effect in expelling devils from homes. In Sahih Muslim, it is reported from our Prophet that he said: ‘Do not turn your houses into graves. Indeed, Satan flees from a house in which Surah Al-Baqarah is recited.’\n\n[5]\n\nReciting the Last Two Verses of Surah Al-Baqarah\n\n. It is authentically reported that the Prophet said:\n\n‘Whoever recites the last two verses of Surah Al-Baqarah at night, they will suffice him’\n\n— meaning, they will protect him from all harm and evil, and from the evil and traps of Satan.\n\n[6] Saying “لَا إِلَهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ”\n\n(There is no god worthy of worship but Allah, alone without partner. His is the dominion and His is the praise, and He is over all things capable.’) This great phrase — the statement of Tawheed — is among the most powerful means of protection from Satan and safeguarding against his evil. In Sahih al-Bukhari and Sahih Muslim, the Prophet said: ‘Whoever says: “There is no god worthy of worship but Allah, alone without partner. His is the dominion and His is the praise, and He is over all things capable” — one hundred times in a day — it will be equivalent to freeing ten slaves, one hundred good deeds will be written for him, one hundred sins erased from him, and it will serve as a protection from Satan for that day until evening.’\n\n[7]\n\nWhen Satan overpowers a person in their sleep (nightmares), they should say:\n\n“أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ”\n\n(I\n\nseek refuge in the perfect words of Allah from His anger and His punishment, from the evil of His servants, and from the incitements of the devils and from their presence\n\n)\n\n[8] Saying ‘Bismillah’\n\n— In the name of Allah when entering one’s home, when eating, and in various other situations throughout daily life.\n\n[9]\n\nA person should beware of excess\n\n— excessive looking, excessive eating, excessive talking, and excessive socializing — for these four are major gateways through which Satan enters upon a person.\n\n[10]\n\nFrequent remembrance of Allah, the Exalted, at all times.",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/08/07/if-satan-whispers-to-you-burn-him-with-these-ten-protections-he-will-never-come-near-you-again/",
    "language": "en"
  },
  {
    "title": "The Softening of the Heart in Ramadhan | Shaykh Abdussalam al-Shuway’ir حفظه الله",
    "author": "The Softening of the Heart in Ramadhan | Shaykh Abdussalam al-Shuway’ir حفظه الله",
    "translator": "",
    "category": "Heart, Heart Softners, Islam, Qur'an, Ramadhan",
    "content": "The Softening of the Heart in Ramadhan | Shaykh Abdussalam al-Shuway’ir حفظه الله [Video | En subtitles] –\n\nhttps://youtu.be/AqHUQX3cJAc\n\n[3:43 min]\n\nFrom the tremendous characteristics acquired during this month is what is related to the softening of the heart. Indeed, this month is a means for the softening of the heart. And the softness of the heart is from the characteristics of the believer. And from the effects of the softness of the heart is that it brings about tears.\n\nIndeed, if the heart softens, the eyes flow with tears.\n\nAnd it comes down out of the fear of Allah ﷻ. Due to this, our Lord said in Al-Ma’idah:83:\n\nWhen they listen to what has been sent down to the Messenger you see their eyes overflowing with tears…\n\nIf an individual reads the Speech of Allah abundantly, and contemplates over its meanings. Indeed, his heart will soften, and his eyes will relent. The greatest month wherein the Qur’an is read is the month of Ramadhan.\n\nDue to this, Allah coupled the Qur’an with this month. He said in Al-Baqarah:185:\n\nThe month of Ramadan in which was revealed the Qur’an, a guidance for mankind and clear proofs for the guidance and the criterion.\n\nIn the Sahih from the Hadith of Ibn Abbas رضي الله عنه, who said that the Prophet ﷺ was the most generous of people. And the most generous he would be was during Ramadhan when Jibril would come to him and study the Qur’an with him. Jibril would study the Qur’an with the Prophet. He would read the Qur’an once every Ramadhan, except the year he passed away, wherein he studied it with Jibril twice.\n\nTherefore, this month is the month of the Qur’an. The Qur’an is read and recited in this month. And in it, the greatest stories are mentioned. And in it, the greatest narrations are mentioned, in reading the beginning of the Book of Allah.\n\nMuhammad Nasr al-Marwazi spoke extensively about the narrations of the Salaf in their recitation of the Qur’an in this month specifically. And the scholars recommend that the month of Ramadhan should not be devoid of a completion of the Qur’an. And that the Tarawih prayers should not be devoid of a completion of the Qur’an.\n\nWhoever reads the Qur’an in the month of Ramadhan and his heart is not softened, and tears don’t come down from his eyes, then it is feared that he has a hard heart. Therefore, Hasan al-Basri رَحِمَهُ ٱللَّٰهُ said:\n\nThe people continue to cry when they remember Allah and when they read the Qur’an.\n\nWhat he meant by: ‘The people’ are the companions of the Messenger of Allah ﷺ. Therefore, this is one of the tremendous objectives, which is refining the character and softening the heart.\n\nAnd the more an individual’s eyes flows with tears, the more of an effect it will have upon his heart, since there is a connection between the eyes and the heart. Listen to the Statement of Allah, Al-Ghafir:19:\n\nAllah knows the fraud of the eyes, and all that the breasts conceal\n\nSome of the people of knowledge derive from this that there is a connection between the eyes and the heart.  Verily, if the heart has fear, then the eyes will shed tears. And the affair of the heart is hidden and what the eyes see are hidden. And other than that which the people of knowledge derive from this tremendous verse.",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/03/09/the-softening-of-the-heart-in-ramadhan-shaykh-abdussalam-al-shuwayir-%d8%ad%d9%81%d8%b8%d9%87-%d8%a7%d9%84%d9%84%d9%87/",
    "language": "en"
  },
  {
    "title": "Deep Advice About Khushū’ – Shaykh Sāleh Sindī [Video | Ar-En Subtitles]",
    "author": "Shaykh Sāleh Sindī",
    "translator": "",
    "category": "Salah (Prayer), Video",
    "content": "Deep Advice About Khushū’ – Shaykh Sāleh Sindī [Video | Ar-En Subtitles]\n\nhttps://youtu.be/Ack_LiUl5uY\n\n[6:48 min]\n\nAs-Salah (The Prayer) – Main Page:\n\nhttps://abdurrahman.org/salah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/08/09/deep-advice-about-khushu/",
    "language": "en"
  },
  {
    "title": "The Truthful Believers Are Firm When There Are Trials – Shaykh Saleh al Fawzan حفظه الله [Video|Ar-En Subtitles]",
    "author": "Shaykh Saleh al Fawzan حفظه الله",
    "translator": "",
    "category": "Islam, Steadfastness (Istiqaamah), Trials - Tests - Fitan",
    "content": "The Truthful Believers Are Firm When There Are Trials\n\nShaykh Saleh al Fawzan حفظه الله\n\nhttps://www.youtube.com/watch?v=uSt8IEpaC6U\n\n[2 Min]\n\nالم أَحَسِبَ النَّاسُ أَن يُتْرَكُوا أَن يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ وَلَقَدْ فَتَنَّا الَّذِينَ مِن قَبْلِهِمْ ۖ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ\n\nAlif-Lam-Mim. Do people think that they will be left alone because they say: “We believe,” and will not be tested. And We indeed tested those who were before them. And Allah will certainly make (it) known (the truth of) those who are true, and will certainly make (it) known (the falsehood of) those who are liars.\n\n(Surah al-Ankabut: 1-3)\n\nمَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ ۗ وَمَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ عَلَى ٱلْغَيْبِ وَلَٰكِنَّ ٱللَّهَ يَجْتَبِى مِن رُّسُلِهِۦ مَن يَشَآءُ ۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦ ۚ وَإِن تُؤْمِنُواْ وَتَتَّقُواْ فَلَكُمْ أَجْرٌ عَظِيمٌ ‎﴿١٧٩﴾‏\n\nAllah will not leave the believers in the state in which you are now, until He distinguishes the wicked from the good. Nor will Allah disclose to you the secrets of the unseen..\n\n(Surah Ale Imran: 179)\n\nSo it will not be clarified for us who are the people of Iman from the people hypocrisy and who are the people of truthfulness from the people of lies unless tests and trials takes place.Verily the truthful believers are firm when there are trials.While the hypocrites and liars get swept away.\n\nوَمِنَ ٱلنَّاسِ مَن يَعْبُدُ ٱللَّهَ عَلَىٰ حَرْفٍ ۖ فَإِنْ أَصَابَهُۥ خَيْرٌ ٱطْمَأَنَّ بِهِۦ ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ ٱنقَلَبَ عَلَىٰ وَجْهِهِۦ خَسِرَ ٱلدُّنْيَا وَٱلْءَاخِرَةَ ۚ ذَٰلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ ‎﴿١١﴾‏\n\nAnd among mankind is he who worships Allah as it were, upon the very edge; if good befalls him, he is content therewith; but if a trial befalls him, he turns back on his face. He loses both this world and the Hereafter. That is the evident loss\n\n(Surah al-Hajj: 11)\n\n—\n\nFitan (Trials) & Istiqamah (Steadfastness):\n\nhttps://abdurrahman.org/fitan-trials-istiqamah-steadfastness/\n\nTesting, Afflictions and Calamities\n\n– Dr Saleh As-Saleh [Audio & Transcribed Notes]\n\nIn times of calamity, people divide into four levels\n\n– Shaykh ibn Uthaymeen\n\nHow to Behave in Times of Fitnah\n\n– Dawud Adib [Audio|En]",
    "references": [
      {
        "type": "Quran",
        "citation": "Surah al-Ankabut: 1-3"
      },
      {
        "type": "Quran",
        "citation": "Surah Ale Imran: 179"
      },
      {
        "type": "Quran",
        "citation": "Surah al-Hajj: 11"
      }
    ],
    "source_url": "https://abdurrahman.org/2025/11/01/the-truthful-believers-are-firm-when-there-are-trials/",
    "language": "en"
  },
  {
    "title": "The Virtue of ‘Arafah and Its Rulings – by Shaykh Sāleh ibn Fawzān al Fawzan حفظه الله [Video|Ar-En Subtitles]",
    "author": "by Shaykh Sāleh ibn Fawzān al Fawzan حفظه الله",
    "translator": "",
    "category": "Hajj, Islam",
    "content": "The Virtue of ‘Arafah and Its Rulings – by Shaykh Sāleh ibn Fawzān al Fawzan\n\nhttps://youtu.be/n4UwdSJClvE\n\n[8 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/06/13/the-virtue-of-arafah-and-its-rulings/",
    "language": "en"
  },
  {
    "title": "Work Shouldn’t Stop One From Seeking Knowledge – Shaykh Sad al Shithri حفظه الله [Video|Ar-En subtitles]",
    "author": "Shaykh Sad al Shithri حفظه الله",
    "translator": "",
    "category": "ilm (Islamic Knowledge), Islam, Student of Knowledge",
    "content": "Work Shouldn’t Stop One From Seeking Knowledge – Shaykh Sad al Shithri حفظه الله [Video|Ar-En subtitles] –\n\nhttps://youtu.be/QDF8HhwPgcY\n\n[1:22 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/01/10/work-shouldnt-stop-one-from-seeking-knowledge/",
    "language": "en"
  },
  {
    "title": "When Afflicted With Doubts – Shaykh Saleh al Usaymi [Video|Ar-En]",
    "author": "Shaykh Saleh al Usaymi",
    "translator": "",
    "category": "Heart, Islam, Steadfastness (Istiqaamah), Video",
    "content": "When Afflicted With Doubts – Shaykh Saleh al Usaymi  [Video|Ar-En]\n\nhttps://youtu.be/a96vxcyIn8c\n\n[2 mins]\n\nThe practice of the Salaf in removing doubts by asking the scholars.\n\nHe said: The practice of the Salaf in removing doubts by asking the scholars.\n\nNot by asking Google, not that an individual searches the websites when he has doubts. No! If you were able to be safe from doubts it wouldn’t have intruded in your heart! So this individual is unable to remove it. Rather, the one that is able to remove it is the one who inherited from the Prophet ﷺ in explaining the religion. You should go back to a scholar and put forth this doubt to him in order for him to remove it for you. Don’t go back to other than him because if you went back to other than him, the doubt will increase and it will be established your heart.\n\nAfterwards, he said:\n\nThe scholars will answer it with what will remove the doubt from him. And this is because they only ascribe the statement to the Messenger\n\nﷺ\n\nHow will the scholar remove the doubt? With proofs, not with their opinions, or with desires, or with what the people of the land were brought up upon. No! Rather these doubts are removed with proofs. So none has the ability to remove doubts unless he has with him an army of proofs. If he doesn’t have an army of proofs, he will be from the humiliated. So the strong from the scholars is the one who is strengthened by an army of proofs from the Statements of Allah and the statements of His Messenger ﷺ. If a doubt takes over the heart of the creation, then he has the weapons that he can repel these doubts from himself and the Muslims. So when a doubt befalls the slave, then he is commanded to ask a firmly grounded scholar about it. And the firmly grounded scholar is commanded to repel these doubts with the Statement of Allah and the statement of His Messenger ﷺ.\n\n—\n\nFitan (Trials) & Istiqamah (Steadfastness)\n\nhttps://abdurrahman.org/fitan-trials-istiqamah-steadfastness/\n\nSubscribe to\n\nScholarly Subtitles\n\ntelegram Channel:\n\nhttps://t.me/Scholarly_Subtitles",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/02/18/when-afflicted-with-doubts/",
    "language": "en"
  },
  {
    "title": "Important Dua for Ramadan",
    "author": "",
    "translator": "",
    "category": "Dua - Occassions, Islam, Ramadhan",
    "content": "Yahya ibn Abi Katheer rahimahullah said, “From amongst the salaf’s duaa was:\n\n‏اَللَّهُمَّ سَلِّمْنـِيْ إِلَى رَمَضَانَ وَسَلِّمْ لِـيْ رَمَضَانَ وَتَسَلَّمْهُ مِنِيْ مُتَقَبَّلاً.\n\n‏Allahumma sallimnee ilaa Ramadan, wa sallim lee Ramadan, wa tasallamhu minnee mutaqabbala\n\n‏ O Allāh, keep me safe until Ramadān, keep Ramadān safe for me, and accept it from me.”\n\n[Latā’if al-Ma’ārif | Page 148 | Al-Imām ibn Rajab al-Hambāli rahimahullah]\n\n—\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/03/07/important-dua-for-ramadan/",
    "language": "en"
  },
  {
    "title": "[Emotional] The Beautiful Advice of Umar ibn al Khattab to a Sinner – Shaykh Abdurrazzaq al Badr [Video|Ar-En]",
    "author": "Shaykh Abdurrazzaq al Badr",
    "translator": "",
    "category": "Dawah, Islam, Seeking Forgiveness (istighfaar), Sins, Tauba (Repentance)",
    "content": "[Emotional] The Beautiful Advice of Umar ibn al Khattab to a Sinner – Shaykh Abdurrazzaq al Badr\n\nhttps://www.youtube.com/watch?v=jzPs_1jaLIM\n\n[8 min]\n\nSins (Main Page):\n\nhttps://abdurrahman.org/sins/\n\nIstighfar & Tawbah\n\n(Main Page)\n\nhttps://abdurrahman.org/istighfar-tawbah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/05/17/emotional-the-beautiful-advice-of-umar-ibn-al-khattab-to-a-sinner/",
    "language": "en"
  },
  {
    "title": "When the Hearts Are Not Filled With the Love of Allah – Shaykh Saleh Ale ash Shaykh حفظه الله [Video | En subtitles]",
    "author": "Shaykh Saleh Ale ash Shaykh حفظه الله",
    "translator": "",
    "category": ".Allaah (Azza wa Jal), Heart, Love (Mahabbah) of Allah, Tawheed",
    "content": "When the Hearts Are Not Filled With the Love of Allah – Shaykh Saleh Ale ash Shaykh حفظه الله [Video|En subtitles] –\n\nhttps://www.youtube.com/watch?v=hTEyqTpu3ho\n\n[1:32 min]\n\nShortcomings in worship, the absence of humility and submission, committing evil actions, falling into the impermissible, and falling short in the obligations only occur when the love of Allah is not filled in the hearts.\n\nAnd when He is not exalted with the utmost exaltation and He is not feared.\n\nThe more the individual contemplates and looks, the more he will know the signs that show that Allah alone is the Lord and He is the One administering, meaning, that which is included in Tawhid al-Rububiyyah- and that everything is in His Hands.\n\nThe more these hearts are filled and are submissive and humbled, even if all of mankind plotted, they wouldn’t pay any attention to it.\n\nThe absence of giving importance to the understanding of Tawhid al-Rububiyyah leads to weakness in the hearts towards the people and weakness in the hearts in holding fast to the religion.\n\nAnd one’s submission will be weak because he doesn’t exalt Allah and he doesn’t see the marvelous creation of Allah in everything.\n\nAnd the individual said well when he said: And in everything has a sign that shows that He is One.",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/01/17/when-the-hearts-are-not-filled-with-the-love-of-allah/",
    "language": "en"
  },
  {
    "title": "Majmoo al-Fatawa of Imam Ibn Baz (rahimahullah) – English Translations [30 Volumes]",
    "author": "",
    "translator": "",
    "category": "eBooks, Islam",
    "content": "English Translations of Majmoo’al-Fatawa of Imam Ibn Baz (rahimahullah)\n\nHe was The Mufti of Kingdom of Saudi Arabia, Chairman of the Council of Senior Scholars,\n\nand Chairman of Department of Scholarly Research andIfta’\n\nClick on the Volume No. to read or download the PDF\n\nVolume\n\n01\n\n|\n\n02\n\n|\n\n03\n\n|\n\n04\n\n|\n\n05\n\n|\n\n06\n\n|\n\n07\n\n|\n\n08\n\n|\n\n09\n\n|\n\n10\n\nVolume\n\n11\n\n|\n\n12\n\n|\n\n13\n\n|\n\n14\n\n|\n\n15\n\n|\n\n16\n\n|\n\n17\n\n|\n\n18\n\n|\n\n19\n\n|\n\n20\n\nVolume\n\n21\n\n|\n\n22\n\n|\n\n23\n\n|\n\n24\n\n|\n\n25\n\n|\n\n26\n\n|\n\n27\n\n|\n\n28\n\n|\n\n29\n\n|\n\n30\n\n—\n\nFatawa – alifta (main page):\n\nhttps://abdurrahman.org/fatawa-alifta",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/05/01/majmoo-al-fatawa-of-imam-ibn-baz/",
    "language": "en"
  },
  {
    "title": "The Legislated Actions During the Ten Days of Dhil Hijjah [Video|Ar-En Subtitles]",
    "author": "",
    "translator": "",
    "category": "Dhul-Hijjah, Islam",
    "content": "The Legislated Actions During the Ten Days of Dhil Hijjah [Video|Ar-En Subtitles]\n\nhttps://youtu.be/dmwC1Lxnsxo\n\n[4 min]\n\nBlessed Days [First 10 Days of Dhul Hijjah]\n\nhttps://abdurrahman.org/hajj/blessed-days-first-10-days-of-dhul-hijjah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/06/09/the-legislated-actions-during-the-ten-days-of-dhil-hijjah/",
    "language": "en"
  },
  {
    "title": "Timeless Advice – Shaykh ibn Bāz [Video | Ar-En Subtitles]",
    "author": "Shaykh ibn Bāz",
    "translator": "",
    "category": "Qur'an, Sunnah, Video",
    "content": "Timeless Advice – Shaykh ibn Bāz [Video | Ar-En Subtitles]\n\nhttps://youtu.be/LTzReiy8t_c\n\n[6 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/08/24/timeless-advice-shaykh-ibn-baz/",
    "language": "en"
  },
  {
    "title": "The happy one is the one who steers clear from the Fitan – Shaykh Abdurrazzaq al Badr حفظه الله [Video|Ar-En subtitles]",
    "author": "Shaykh Abdurrazzaq al Badr حفظه الله",
    "translator": "",
    "category": "Islam, Trials - Tests - Fitan, Video",
    "content": "The happy one is the one who steers clear from the Fitan\n\nShaykh Abdurrazzaq al Badr حفظه الله [Video|Ar-En subtitles]\n\nhttps://youtu.be/eeUkm3DnY-w\n\n[ 4 min]\n\nIt has been authenticated from our noble Prophet ﷺ in the Sunan and in the Musnad from the Hadith of al-Miqdad ibn al-Aswad رضي الله عنه who said that the Prophet ﷺ said:\n\n“Verily the happy one is the one who steers clear from the Fitan”\n\nOur noble Prophet ﷺ repeated it like this. Contemplate upon this firm connection and tremendous relation between happiness and steering clear from the Fitan. And that an individual steering clear, being distant from, and not delving into the Fitan is one of the doors and tremendous paths to happiness. And an individual’s portion of this happiness that is alluded to in this Hadith is in accordance of his distance from the Fitan. The more distant he is from the Fitan, the greater the portion of this happiness he will have. And the closer he is towards the Fitan, the greater the portion of misery and destruction he will have.\n\nContemplate over this matter in the statement of the Prophet ﷺ :\n\n“After me there will be Fitnah. The state of the one who is sitting will be better than the one who is standing. And the state of the one standing will be better than the one who is walking. And the state of the one who is walking will be better than the one who is running.”\n\nLook at the one who is further away from the Fitan. His portion of happiness is greater and he is safer from destruction. Look at how the one who is closer to the Fitan… The one standing is closer to the Fitnah than the one who is sitting. The one walking towards the Fitnah is closer to the one who is standing. The one running towards the Fitnah is closer to the one who is walking towards it. So the slave’s portion of this tremendous happiness that is alluded to in this Hadith is in accordance to his distance and his steering clear from the Fitan.\n\nTherefore, as we mentioned, the Hadith regarding steering clear from the Fitan is a Hadith regarding happiness. Delving and getting involved into Fitan is entering into misery which is the opposite of happiness because the opposite of happiness is misery.So whoever steers clear of Fitan will be happy. As it comes in the text of the Hadith. Verily the happy one is the one who steers clear from the Fitan.\n\nThe implicit understanding is that the one who delves and gets involved in the Fitan will be miserable. So happiness is in steering clear from the Fitan and misery is in getting involved in the Fitan. So everytime an individual gets involved in the Fitan, he enters into what will necessitate his own destruction.\n\nFitan (Trials) & Istiqamah (Steadfastness) – Main Page\n\nhttps://abdurrahman.org/fitan-trials-istiqamah-steadfastness/\n\nSubscribe to Scholarly Subtitles Youtube Channel:\n\nhttps://www.youtube.com/@Scholarly_Subtitles",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/08/16/the-happy-one-is-the-one-who/",
    "language": "en"
  },
  {
    "title": "From the Signs of the Hour – The Nations summon one another to fight the Muslims | Shaykh Saleh al Fawzan [Video|Ar-En subtitles]",
    "author": "The Nations summon one another to fight the Muslims | Shaykh Saleh al Fawzan",
    "translator": "",
    "category": "Islam, Ummah",
    "content": "From the Signs of the Hour – The Nations summon one another to fight the Muslims | Shaykh Saleh al Fawzan [Video|Ar-En subtitles] –\n\nhttps://youtu.be/TOR8tNYplv8\n\n[3 min]\n\nUmmah & Unity\n\nhttps://abdurrahman.org/ummah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/08/31/from-the-signs-of-the-hour-the-nations-summon-one-another-to-fight-the-muslims/",
    "language": "en"
  },
  {
    "title": "The Wisdom Behind the Istinshaq – Shaykh Sulayman al Ruhayli حفظه الله [Video | En subtitles]",
    "author": "Shaykh Sulayman al Ruhayli حفظه الله",
    "translator": "",
    "category": "Saum (Fasting), Wudhu (Ablution)",
    "content": "The Wisdom Behind the Istinshaq – Shaykh Sulayman al Ruhayli حفظه الله [Video | En subtitles] –\n\nhttps://youtu.be/dIWyc5MRMWg\n\n[2:13 min]\n\nVerily, many people nowadays are neglectful regarding the sniffing the water up the nose during Wudhu (\n\nIstinshaq\n\n) to begin with.\n\nThey might not be neglectful in rinsing the mouth (Madhmadha). And what is correct is that it is not a condition that one needs to thoroughly rinse the mouth. However when it comes to the Istinshaq, you find some people taking water and putting it at the end of the nose as if he is washing the nose on the outside. He doesn’t sniff the water. And this is not considered Istinshaq.\n\nExaggerating (Mubalaghah) is more than Madhmadha and Istinshaq.\n\nMubalaghah in Madhmadha\n\nis when the individual enters the water in his mouth and thoroughly rinses it in his mouth.\n\nMubalaghah in Istinshaq\n\nis when the individual sniffs the water until it reaches the upper end of his nose. He exaggerates in sniffing the water.\n\nI’ve heard a doctor say that if the Muslims were to act upon the Sunnah in exaggerating in their Istinshaq, they would be safe from many illnesses. He says that many illnesses enter the body by way of the nose. So if they were to exaggerate in their Istinshaq, that area would be washed and the matters that cause illnesses would be removed.\n\nAnd nothing has come from the Prophet except every type of good. Mubalaghah in Madhmadha and Istinshaq is a benefit.\n\nHowever, it is disliked for the one who is fasting because water enters the stomach. Therefore, the Prophet said:\n\nAnd exaggerate in Istinshaq except if you are fasting.",
    "references": [],
    "source_url": "https://abdurrahman.org/2025/03/01/the-wisdom-behind-the-istinshaq-shaykh-sulayman-al-ruhayli-%d8%ad%d9%81%d8%b8%d9%87-%d8%a7%d9%84%d9%84%d9%87-video-en-subtitles/",
    "language": "en"
  },
  {
    "title": "“.. his reward is 50 from the companions” – The Strangers (Ghuraba) by Shaykh ibn Bāz رحمه الله",
    "author": "The Strangers (Ghuraba) by Shaykh ibn Bāz رحمه الله",
    "translator": "",
    "category": "Great Rewards, Islam, Sunnah",
    "content": "“.. his reward is 50 from the companions” – The Strangers by Shaykh ibn Bāz رحمه الله\n\nhttps://youtu.be/JCfL743dhzM\n\n[ 1min]\n\nThe Prophet (ﷺ) stated,\n\n“Ahead of you are days of patience, when holding onto the religion will be like holding onto hot coals, and whomsoever holds onto His religion in that time, then his reward will be the reward of fifty men.” The Companions said, “O Messenger of Allah, fifty times the worth of their reward?” He said, “Rather fifty from you.”\n\nCollected by Abu Dawood, At-Tirmidhi, Ibn Mājah, Al-Hākim who declared it authentic, Adh-Dhahabi agreed and Al-Albāni declared it Saheeh in As-Saheehah (no. 494).\n\nSunnah (Main Page)\n\n:\n\nhttps://abdurrahman.org/sunnah/\n\nThere will always be a group of people upon the Truth and the Sunnah\n\n– Sharh as-Sunnah | Shaykh Fawzan | Dawud Burbank [Audio|En]\n\nAhl-ul-Hadeeth (People of Hadeeth)\n\n– Dr. Muhammad Deeya ar-Rahman al-Azamee\n\nThe Strangeness Of The Sunnah And its Adherents\n\n– Imam Ibn Rajab\n\nEach Group Claiming to be the Victorious One!\n\n– by Ibn Baz\n\nThe Strangers (Ghurabaa) & The Evils of Doubts and Desires\n\n– Al-Haafidh Ibn Rajab\n\nAlleviating Grievances in Describing the Condition of the Strangers\n\n– Ibn Rajab\n\nMethodology of the Saved Sect\n\n– Shaykh Muhammad Ibn Jameel Zaynoo",
    "references": [],
    "source_url": "https://abdurrahman.org/2024/05/12/his-reward-is-50-from-the-companions-the-strangers/",
    "language": "en"
  },
  {
    "title": "The Means in Attaining the Heart’s ease – Shaykh Abdurrazzaq al Badr [Video | Ar-En Subtitles]",
    "author": "Shaykh Abdurrazzaq al Badr",
    "translator": "",
    "category": "Heart",
    "content": "The Means in Attaining the Heart’s ease – Shaykh Abdurrazzaq al Badr\n\nhttps://youtu.be/k3ixE30gsjk\n\n[17:29 min] [Arabic|English Subtitles]\n\nHeart\n\n–\n\nhttps://abdurrahman.org/category/islam/heart/\n\nFor anxiety and sorrow:\n\nاللّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤكَ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنورَ صَدْرِي وجَلَاءَ حُزْنِي وذَهَابَ هَمِّي\n\nAllaahumma ‘innee ‘abduka, ibnu ‘abdika, ibnu ‘amatika, naasiyatee biyadika, maadhin fiyya hukmuka, ‘adlun fiyya qadhaa’uka, ‘as’aluka bikulli ismin huwa laka, sammayta bihi nafsaka, ‘aw ‘anzaltahu fee kitaabika, ‘aw ‘allamtahu ‘ahadan min khalqika, ‘awista’tharta bihi fee ‘ilmil-ghaybi ‘indaka, ‘an taj’alal-Qur’aana rabee’a qalbee, wa noora sadree, wa jalaa’a huznee, wa thahaaba hammee\n\nO Allah, I am Your slave and the son of Your male slave and the son of Your female slave. My forehead is in Your Hand (i.e. You have control over me). Your Judgment upon me is assured and Your Decree concerning me is just. I ask You by every Name that You have named Yourself with, revealed in Your Book, taught any one of Your creation or kept unto Yourself in the knowledge of the unseen that is with You, to make the Qur’an the spring of my heart, and the light of my chest, the banisher of my sadness and the reliever of my distress.\n\n[Ahmad 1/391, and Al-Albani graded it authentic]",
    "references": [
      {
        "type": "Hadith",
        "citation": "Ahmad 1"
      }
    ],
    "source_url": "https://abdurrahman.org/2023/07/16/the-means-in-attaining-the-hearts-ease/",
    "language": "en"
  },
  {
    "title": "Beware of This Deception, May Allah Protect You! – Shaykh Saleh Sindi [Video| Ar-En]",
    "author": "Shaykh Saleh Sindi",
    "translator": "",
    "category": ".Our Prophet, Ahlul Kitab (People of the Book), Christians (Nasara), Jews (Yahood), Video",
    "content": "Beware of This Deception, May Allah Protect You ! – Shaykh Saleh Sindi [Video| Ar-En]\n\nhttps://youtu.be/NzDZb9ojDW8\n\n[5:50 Min] [Arabic | English Subtitles]\n\nإِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًۭا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ\n\nVerily! Those who believe and those who are Jews and Christians, and Sabians, whoever believes in Allâh and the Last Day and does righteous good deeds shall have their reward with their Lord, on them shall be no fear, nor shall they grieve\n\n(Suratul Baqarah 2:62)\n\nEnglish – Tafsir Ibn Kathir\n\nFaith and doing Righteous Deeds equals Salvation in all Times\n\nAllah says;\n\nإِنَّ الَّذِينَ امَنُواْ وَالَّذِينَ هَادُواْ وَالنَّصَارَى وَالصَّابِيِينَ مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الاخِرِ وَعَمِلَ صَالِحاً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ\n\nVerily, those who believe and those who are Jews and Christians, and Sabians (Sabi’in), whoever believes in Allah and the Last Day and does righteous good deeds shall have their reward with their Lord, on them shall be no fear, nor shall they grieve.\n\nAfter Allah described the condition – and punishment – of those who defy His commands, fall into His prohibitions and transgress set limits by committing prohibited acts, He stated that the earlier nations who were righteous and obedient received the rewards for their good deeds. This shall be the case, until the Day of Judgment. Therefore, whoever follows the unlettered Messenger and Prophet shall acquire eternal happiness and shall neither fear from what will happen in the future nor become sad for what has been lost in the past.\n\nSimilarly, Allah said,\n\nأَلا إِنَّ أَوْلِيَأءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ\n\nNo doubt! Verily, the Awliya of Allah, no fear shall come upon them nor shall they grieve. (10:62)\n\nThe angels will proclaim to the dying believers, as mentioned,\n\nإِنَّ الَّذِينَ قَالُواْ رَبُّنَا اللَّهُ ثُمَّ اسْتَقَـمُواْ تَتَنَزَّلُ عَلَيْهِمُ الْمَلَـيِكَةُ أَلاَّ تَخَافُواْ وَلَا تَحْزَنُواْ وَأَبْشِرُواْ بِالْجَنَّةِ الَّتِى كُنتُمْ تُوعَدُونَ\n\nVerily, those who say:”Our Lord is Allah (alone),” and then they stand firm, on them the angels will descend (at the time of their death) (saying):”Fear not, nor grieve! But receive the glad tidings of Paradise which you have been promised!” (41:30)\n\nThe Meaning of Mu’min, or Believer\n\nAli bin Abi Talhah narrated from Ibn Abbas, about,\n\nإِنَّ الَّذِينَ امَنُواْ وَالَّذِينَ هَادُواْ وَالنَّصَارَى وَالصَّابِيِينَ مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الاخِرِ\n\n(Verily, those who believe and those who are Jews and Christians, and Sabians, whoever believes in Allah and the Last Day) that Allah revealed the following Ayah afterwards,\n\nوَمَن يَبْتَغِ غَيْرَ الاِسْلَـمِ دِينًا فَلَن يُقْبَلَ مِنْهُ وَهُوَ فِى الاٌّخِرَةِ مِنَ الْخَـسِرِينَ\n\nAnd whoever seeks religion other than Islam, it will never be accepted of him, and in the Hereafter he will be one of the losers.\n\n(3:85).\n\nThis statement by Ibn Abbas indicates that Allah does not accept any deed or work from anyone, unless it conforms to the Law of Muhammad that is, after Allah sent Muhammad. Before that, every person who followed the guidance of his own Prophet was on the correct path, following the correct guidance and was saved.\n\nWhy the Jews were called `Yahud\n\nThe Jews are the followers of Prophet Musa, who used to refer to the Tawrah for judgment. Yahud is a word that means,\n\n`repenting’, just as Musa said,\n\nإِنَّا هُدْنَـا إِلَيْكَ\n\n(We have Hudna (we repent, go back and return) unto You), (7:156).\n\nWhy the Christians were called Nasara\n\nAllah said;\n\nمَنْ أَنصَارِى إِلَى اللَّهِ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ\n\n“Who will be my helpers in Allah’s cause” Al-Hawariyyun said:”We are the helpers of Allah.” (61:14)\n\nIt was said that;\n\nthey were called `Nasara’, because they inhabited a land called An-Nasirah (Nazareth), as Qatadah, Ibn Jurayj and Ibn Abbas were reported to have said, Allah knows best.\n\nNasara is certainly plural for Nasran.\n\nWhen Allah sent Muhammad as the Last and Final Prophet and Messenger to all of the Children of Adam, mankind was required to believe in him, obey him and refrain from what he prohibited them; those who do this are true believers. The Ummah of Muhammad was called `Mu’minin’ (believers), because of the depth of their faith and certainty, and because they believe in all of the previous Prophets and matters of the Unseen.\n\nThe Sabi’un or Sabians\n\nThere is a difference of opinion over the identity of the Sabians.\n\nSufyan Ath-Thawri said that Layth bin Abu Sulaym said that Mujahid said that,\n\n“The Sabians are between the Majus, the Jews and the Christians. They do not have a specific religion.”\n\nSimilar is reported from Ibn Abi Najih.\n\nSimilar statements were attributed to Ata and Sa`id bin Jubayr.\n\nThey (others) say that;\n\nthe Sabians are a sect among the People of the Book who used to read the Zabur (Psalms), others say that they are a people who worshipped the angels or the stars.\n\nIt appears that the closest opinion to the truth, and Allah knows best, is Mujahid’s statement and those who agree with him like Wahb bin Munabbih, that;\n\nthe Sabians are neither Jews nor Christians nor Majus nor polytheists. Rather, they did not have a specific religion that they followed and enforced, because they remained living according to their Fitrah (instinctual nature). This is why the idolators used to call whoever embraced Islam a `Sabi’, meaning, that he abandoned all religions that existed on the earth.\n\nSome scholars stated that;\n\nthe Sabians are those who never received a message by any Prophet.\n\nAnd Allah knows best",
    "references": [
      {
        "type": "Quran",
        "citation": "Suratul Baqarah 2:62"
      }
    ],
    "source_url": "https://abdurrahman.org/2023/08/01/beware-of-this-deception-may-allah-protect-you/",
    "language": "en"
  },
  {
    "title": "Allāh ﷻ says, ‘Fasting is For Me’ – by Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]",
    "author": "by Shaykh Sulaymān al Ruhaylī",
    "translator": "",
    "category": "Islam, Ramadhan, Saum (Fasting), Video",
    "content": "Allāh ﷻ says, ‘Fasting is For Me’ – by Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]\n\nhttps://youtu.be/L00tSbY6kjU\n\n[3 min]\n\n[Arabic | English subtitles]\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/03/26/allah-says-fasting-is-for-me/",
    "language": "en"
  },
  {
    "title": "The Religion is Victorious With or Without Us! – Shaykh Saleh al Fawzan حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Saleh al Fawzan حفظه الله",
    "translator": "",
    "category": "Dawah, Islam",
    "content": "The Religion is Victorious With or Without Us! – Shaykh Saleh al Fawzan حفظه الله\n\nhttps://youtu.be/dr4v5b1Mn14\n\n[Video | Ar-En Subtitles] [1:38 min]\n\nDawah (Main Page):\n\nhttps://abdurrahman.org/dawah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/13/the-religion-is-victorious-with-or-without-us/",
    "language": "en"
  },
  {
    "title": "Don’t Forget to Make This Du’ā When Ramadhān Arrives – Shaykh ‘Abdurrazzāq al Badr [Ar|En Subtitles]",
    "author": "Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Dua - Occassions, Dua - Supplication, Islam, Ramadhan",
    "content": "Don’t Forget to Make This Du’ā When Ramadhān Arrives – Shaykh ‘Abdurrazzāq al Badr [Ar|En Subtitles]\n\nhttps://youtu.be/0f2-jAGx5IA\n\n[38 seconds] [Ar|En subtitles]\n\nSighting the new moon:\n\nاللهُ أَكْبَر، اللّهُمَّ أَهِلَّهُ عَلَيْنا بِالأمْنِ وَالإيمان، والسَّلامَةِ والإسْلام، وَالتَّوْفيقِ لِما تُحِبُّ رَبَّنا وَتَرْضى، رَبُّنا وَرَبُّكَ الله\n\nAllaahu ‘Akbar, Allaahumma ‘ahillahu ‘alayna bil’amni wal’eemaani, wassalaamati wal-‘Islaami, wattawfeeqi limaa tuhibbu Rabbanaa wa tardhaa, Rabbunaa wa Rabbukallaahu\n\nAllah is the Most Great. O Allah, bring us the new moon with security and Faith, with peace and in Islam, and in harmony with what our Lord loves and what pleases Him. Our Lord and your Lord is Allah.\n\n[At-Tirmithi 5/504, Ad-Darimi 1/336. See also Al-Albani, Sahih At-Tirmithi 3/157]\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/03/22/dont-forget-to-make-this-dua-when-ramadhan-arrives/",
    "language": "en"
  },
  {
    "title": "If You Want to Be Firm in Aqīdah, Read These Three Books – Shaykh Sāleh Sindī حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Sāleh Sindī حفظه الله",
    "translator": "",
    "category": "Aqeedah (Creed), Islam",
    "content": "If You Want to Be Firm in Aqīdah, Read These Three Books – Shaykh Sāleh Sindī حفظه الله\n\nhttps://youtu.be/4Ztw2j17Qf0\n\n[7:50 min] [Video | Ar-En Subtitles]\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nAqeedah (Main Page):\n\nhttps://abdurrahman.org/belief/aqeedah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/06/if-you-want-to-be-firm-in-aqidah-read-these-three-books/",
    "language": "en"
  },
  {
    "title": "Safeguarding the Supererogatory Acts – Shaykh Abdulkarim al Khudhayr [Video | Ar-En Subtitles]",
    "author": "Shaykh Abdulkarim al Khudhayr",
    "translator": "",
    "category": "Islam, Worship (Ibadah)",
    "content": "Safeguarding the Supererogatory Acts – Shaykh Abdulkarim al Khudhayr حفظه الله\n\nhttps://youtu.be/ljX7oWOPxC8\n\n[ 1min]\n\nIbadah (Worship) – Main Page:\n\nhttps://abdurrahman.org/ibadah-worship/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/04/safeguarding-the-supererogatory-acts/",
    "language": "en"
  },
  {
    "title": "The Salaf and the Adhan – Shaykh Sulayman al Ruhayli حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Sulayman al Ruhayli حفظه الله",
    "translator": "",
    "category": "Adhan & Iqaamah, Salah (Prayer), Video",
    "content": "The Salaf and the Adhan – Shaykh Sulayman al Ruhayli حفظه الله\n\nhttps://youtu.be/s2COrgI-ISY\n\n[1:12 min]\n\n[Arabic|English subtitles]\n\nAdhan (Call to Prayer)\n\n– Main Page",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/11/the-salaf-and-the-adhan/",
    "language": "en"
  },
  {
    "title": "What to Say When the Imām Praises Allāh During the Qunūt? – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]",
    "author": "Shaykh Sulaymān al Ruhaylī",
    "translator": "",
    "category": "Islam, Ramadhan, Video",
    "content": "What to Say When the Imām Praises Allāh During the Qunūt? – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]\n\nhttps://youtu.be/w_eGoB4dFTA\n\n[ 1min]\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/04/01/what-to-say-when-the-imam-praises-allah-during-the-qunut/",
    "language": "en"
  },
  {
    "title": "Paramount Advice for the Muslim Woman – by Shaykh Sāleh ibn Fawzān al Fawzān حفظه الله [Arabic-English Subtitles]",
    "author": "by Shaykh Sāleh ibn Fawzān al Fawzān حفظه الله",
    "translator": "",
    "category": "Women, Women Beautification, Women Dress (Hijaab)",
    "content": "Paramount Advice for the Muslim Woman – by Shaykh Sāleh ibn Fawzān al Fawzān حفظه الله\n\nhttps://youtu.be/EFu5Fji1jtw\n\n[9 min] [Arabic-English Subtitles]\n\nWomen\n\n–\n\nhttps://abdurrahman.org/women/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/05/paramount-advice-for-the-muslim-woman/",
    "language": "en"
  },
  {
    "title": "Laylat al Qadr Was on the 21st Night During the Time of the Prophet ﷺ – by Shaykh al ‘Uthaymīn [Video|Ar-En Subtitles]",
    "author": "by Shaykh al ‘Uthaymīn",
    "translator": "",
    "category": "Islam, Ramadhan, Video",
    "content": "Laylat al Qadr Was on the 21st Night During the Time of the Prophet ﷺ – by Shaykh al ‘Uthaymīn\n\nhttps://youtu.be/_pgJvUI8A5E\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/04/11/laylat-al-qadr-was-on-the-21st-night-during-the-time-of-the-prophet/",
    "language": "en"
  },
  {
    "title": "The Beautiful Story Between Baqiyy Ibn Makhlad and Imam Ahmad – Shaykh Saleh Ale ashShaykh حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Saleh Ale ashShaykh حفظه الله",
    "translator": "",
    "category": "ilm (Islamic Knowledge), Inspirational Stories",
    "content": "The Beautiful Story Between Baqiyy Ibn Makhlad and Imam Ahmad – Shaykh Saleh Ale ash Shaykh حفظه الله\n\nhttps://youtu.be/kexPDupLh0Y\n\n[7:40 min] [Ar|En Subtitles]\n\nKnowledge (Main Page):\n\nhttps://abdurrahman.org/knowledge/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/14/the-beautiful-story-between-baqiyy-ibn-makhlad-and-imam-ahmad/",
    "language": "en"
  },
  {
    "title": "Like Leaves Fall off the Tree – Shaykh Abdurrazzaq al Badr [shorts]",
    "author": "Shaykh Abdurrazzaq al Badr",
    "translator": "",
    "category": "Dhikr (Remembrance), Great Rewards, Sins",
    "content": "Like Leaves Fall off the Tree – Shaykh Abdurrazzaq al Badr [shorts]\n\nhttps://youtube.com/shorts/FcwocL9sNAc\n\n[1 min] [Arabic – English Subtitles]\n\nDhikr (Remembrance of Allaah)\n\n:\n\nhttps://abdurrahman.org/dhikr/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/20/like-leaves-fall-off-the-tree/",
    "language": "en"
  },
  {
    "title": "Don’t Belittle Any Good Deed – Shaykh Abdurrazzaq al Badr حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Abdurrazzaq al Badr حفظه الله",
    "translator": "",
    "category": "Family, Islam, Manners & Character, Wealth - Rizq - Sustenance",
    "content": "Don’t Belittle Any Good Deed – Shaykh Abdurrazzaq al Badr حفظه الله\n\nhttps://youtu.be/9zApkkjQ4zo\n\n[4:49 min][Arabic|English subtitles]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/17/dont-belittle-any-good-deed/",
    "language": "en"
  },
  {
    "title": "Moments of Humbleness in the Masjid of the Messenger of Allah ﷺ – Shaykh Sulayman al Ruhayli [Video | Ar-En Subtitles]",
    "author": "Shaykh Sulayman al Ruhayli",
    "translator": "",
    "category": "Hajj, Islam, Madina, Picture Making, Umrah (Minor Pilgrimage)",
    "content": "Moments of Humbleness in the Masjid of the Messenger of Allah ﷺ – Shaykh Sulayman al Ruhayli\n\nhttps://youtu.be/PvZzycATAd0\n\n[2:36 min] [Arabic|English subtitles]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/15/moments-of-humbleness-in-the-masjid-of-the-messenger-of-allah/",
    "language": "en"
  },
  {
    "title": "Allāh’s Perfect Wisdom – by Shaykh Sāleh Sindī [Video | Ar-En Subtitles]",
    "author": "by Shaykh Sāleh Sindī",
    "translator": "",
    "category": ".Allaah (Azza wa Jal), Asma wa Sifaat",
    "content": "Allāh’s Perfect Wisdom – by Shaykh Sāleh Sindī حفظه الله [Video | Ar-En Subtitles]\n\nhttps://youtu.be/hv5Wly1jWxQ\n\n[7:31 min]\n\nAllaah (Azza wa Jal):\n\nhttps://abdurrahman.org/allah/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/08/02/allahs-perfect-wisdom/",
    "language": "en"
  },
  {
    "title": "The Means of Treating Boredom in Seeking Knowledge – Shaykh Sulayman al Ruhayli حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Sulayman al Ruhayli حفظه الله",
    "translator": "",
    "category": "ilm (Islamic Knowledge), Student of Knowledge",
    "content": "The Means of Treating Boredom in seeking knowledge – Shaykh Sulayman al Ruhayli حفظه الله\n\nhttps://youtu.be/2DChGCDKsCc\n\n[6:23 min] [Arabic | English Subtitles]\n\nKnowledge\n\n(Main Page)\n\n:\n\nhttps://abdurrahman.org/knowledge/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/27/the-means-of-treating-boredom-in-seeking-knowledge/",
    "language": "en"
  },
  {
    "title": "The Muslim Woman In Ramadhān – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]",
    "author": "Shaykh Sulaymān al Ruhaylī",
    "translator": "",
    "category": "Islam, Ramadhan, Women",
    "content": "The Muslim Woman In Ramadhān – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]\n\nhttps://www.youtube.com/watch?v=4IlZMBSMe40\n\n[2 min]\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/04/07/the-muslim-woman-in-ramadhan/",
    "language": "en"
  },
  {
    "title": "Combine the Best Two Things – Shaykh Sulayman al Ruhayli حفظه الله [Video | Ar-En Subtitles]",
    "author": "Shaykh Sulayman al Ruhayli حفظه الله",
    "translator": "",
    "category": "Islam, Qur'an, Tafseer ul Qur'an",
    "content": "Combine the Best Two Things – Shaykh Sulayman al Ruhayli حفظه الله [Video | Ar-En Subtitles]\n\nhttps://youtu.be/02wlDIXpOjI\n\n[1:20 min]\n\nQur’an (Main Page\n\n):\n\nhttps://abdurrahman.org/quran/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/07/28/combine-the-best-two-things/",
    "language": "en"
  },
  {
    "title": "﴾Verily, in the Remembrance of Allah Do Hearts Find Rest﴿ – Shaykh Abdurrazzaq al Badr [Video | Ar-En Subtitles]",
    "author": "Shaykh Abdurrazzaq al Badr",
    "translator": "",
    "category": "Dhikr (Remembrance), Islam",
    "content": "﴾Verily, in the Remembrance of Allah Do Hearts Find Rest﴿\n\nShaykh Abdurrazzaq al Badr [Video | Ar-En Subtitles]\n\nhttps://youtu.be/YSqkB4aKrMY\n\n[50 min]\n\nContents\n\n0:00\n\nIntroduction\n\n2:20\n\nThe gatherings of the remembrance of Allah\n\n6:36\n\nVerily, in the remembrance of Allah do hearts find rest\n\n9:39\n\nBeing heedless of the remembrance of Allah\n\n11:59\n\nThe remembrance of Allah is the true life of the hearts\n\n16:48\n\nThe remembrance of Allah expels the Shaytan\n\n24:56\n\nThe dire need of the slave for the remembrance of Allah\n\n28:01\n\nThe command to remember Allah frequently\n\n29:20\n\nThe virtues of the remembrance of Allah In the Sunnah\n\n31:37\n\nThe remembrance of Allah is the objective of every worship\n\n32:17\n\nThe people who remember Allah most in their worship have the greater reward\n\n35:20\n\nThe highest level of remembrance\n\n36:10\n\nUnderstanding the meanings of the remembrances\n\n43:39\n\nThe most beloved to Allah are four\n\n45:40\n\nConclusion\n\n—\n\nDhikr (Remembrance of Allaah) – Main Page\n\nhttps://abdurrahman.org/dhikr\n\nYou can buy the book here:\n\nhttps://www.amazon.com/VERILY-REMEMBRANCE-ALL%C4%80H-HEARTS-FIND/dp/1640074422",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/06/05/verily-in-the-remembrance-of-allah-do-hearts-find-rest/",
    "language": "en"
  },
  {
    "title": "Good Character Returns Back To Four Aḥādīth – by Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En Subtitles]",
    "author": "by Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Islam, Manners & Character, Video",
    "content": "Good Character Returns Back To Four Aḥādīth – by Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En Subtitles]\n\nhttps://youtu.be/Y5MUG1AeI5c\n\n[2:50 min]\n\nAbee Zayd al-Qayrawaanee, (the Imam famous well known as, Malik As-Sagheer) (May Allah have mercy on him) says:\n\n“The narrations of morals and manners have been combined into four narrations”\n\nThe Prophet (Sallallaahu alayhi wa Sallam) said:\n\n“Whoever believes in Allah and the last day then let him say (a word that is) good or be silent.”\n\nAnd the Prophet (Sallallaahu alayhi wa Sallam) said:\n\n“From the goodness of a person’s Islam is that he leaves off that which does not concern him.”\n\nAlso, the Prophet (Sallallaahu alayhi wa Sallam) said to the one who sought advice from him:\n\n“Do not become angry!”\n\nLikewise, the Prophet (Sallallaahu alayhi wa Sallam) said:\n\n“None of you (truly) believes until he loves for his brother, what he loves for himself.”\n\nHence, these four narrations- are all from forty hadeeth of the narrations regarding morals and manners-collected by Imam Nawawee (May Allah be pleased with him).\n\nCharacter (Main Page):\n\nhttps://abdurrahman.org/character/\n\nManners & Character:\n\nhttps://abdurrahman.org/category/islam/manners-character",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/09/good-character-returns-back-to-four-a%e1%b8%a5adith/",
    "language": "en"
  },
  {
    "title": "[Must Listen] The Humbleness of Shaykh ‘Abdulmuhsin ibn Hamad al ‘Abbād [Video|Ar-En]",
    "author": "",
    "translator": "",
    "category": "Humility, Scholars, Scholars Biographies, Video",
    "content": "[Must Listen] The Humbleness of Shaykh ‘Abdulmuhsin ibn Hamad al ‘Abbād [Video|Ar-En Subtitles]\n\nNarrated by – by Shaykh ‘Abdurrahmān al ‘Omaysān\n\nhttps://youtu.be/HUdcMCWHfG8\n\n[6 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/01/the-humbleness-of-shaykh-abdulmuhsin-al-abbad/",
    "language": "en"
  },
  {
    "title": "The Legislated Visiting Sites In al Madinah – Shaykh ‘Abdulmuḥsin ‘Abbād حفظه الله",
    "author": "Shaykh ‘Abdulmuḥsin ‘Abbād حفظه الله",
    "translator": "",
    "category": "Hajj, Islam, Madina, Umrah (Minor Pilgrimage), Video",
    "content": "The Legislated Visiting Sites In al Madinah –  Shaykh ‘Abdulmuḥsin ‘Abbād حفظه الله\n\nhttps://youtu.be/eV1uKZFmrV0\n\n[2 min]\n\nUmrah\n\n(Main Page):\n\nhttps://abdurrahman.org/umrah/\n\nHajj\n\n(Main Page) :\n\nhttps://abdurrahman.org/hajj/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/08/the-legislated-visiting-sites-in-al-madinah/",
    "language": "en"
  },
  {
    "title": "Two Extremely Important Pieces of Benefit to Act Upon Now – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]",
    "author": "Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Great Rewards, Intentions (Niyyah), Video",
    "content": "Two Extremely Important Pieces of Benefit to Act Upon Now – Shaykh ‘Abdurrazzāq al Badr حفظه الله\n\nhttps://youtu.be/cfrW4Ot6BnE\n\n[13 min]\n\nIntentions (Niyyah):\n\nhttps://abdurrahman.org/category/islam/intentions-niyyah/\n\nGreat Rewards:\n\nhttps://abdurrahman.org/category/islam/great-rewards/",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/11/two-extremely-important-pieces-of-benefit/",
    "language": "en"
  },
  {
    "title": "The Origins of the Mawlid (Milad-un-Nabee) – Shaykh ‘Abdulmuhsin al ‘Abbād حفظه الله [Video|Ar-En]",
    "author": "Shaykh ‘Abdulmuhsin al ‘Abbād حفظه الله",
    "translator": "",
    "category": ".Our Prophet, Ahlul-Bidah, Bidah (Innovated) Celebrations, Bidah (Innovation), Mawlid (Milad an-Nabi), Video",
    "content": "The Origins of the Mawlid (Milad-un-Nabee) – Shaykh ‘Abdulmuhsin al ‘Abbād حفظه الله [Video|Ar-En]\n\nhttps://youtu.be/Z3bLxnRUayk\n\n[3 min]\n\nMawlid (Milad an-Nabi)\n\nhttps://abdurrahman.org/category/islam/mawlid-milad-an-nabi/\n\nBid’ah (Innovation in the Religion)\n\nhttps://abdurrahman.org/innovation/\n\n[ Prophet Muhammad ﷺ ]\n\nhttps://abdurrahman.org/muhammad/",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/01/the-origins-of-the-mawlid-milad-un-nabee/",
    "language": "en"
  },
  {
    "title": "Contemplating Over Sūrah al Naba – Shaykh Sulaymān al Ruhaylī [Ar|En Subtitles]",
    "author": "Shaykh Sulaymān al Ruhaylī",
    "translator": "",
    "category": "Islam, Tafseer ul Qur'an, Video",
    "content": "Contemplating Over Sūrah al Naba – Shaykh Sulaymān al Ruhaylī\n\nhttps://youtu.be/FaHr7ffVGxM\n\n[43 min]\n\nExplaining Surah an-Naba\n\n– Shaykh ibn Uthaymeen | Abu az-Zubayr Harrison\n\nThe Tafseer of Sooratun-Nabaa\n\n– Dr. Saleh as-Saleh (rahimahullah)\n\nTafseer-ul-Qur’an (Main Page)\n\nhttps://abdurrahman.org/tafseer-ul-quran/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/18/contemplating-over-surah-al-naba-shaykh-sulayman-al-ruhayli/",
    "language": "en"
  },
  {
    "title": "Immense reward of Seeking Forgiveness For Every Believer – Shaykh ‘Abdurrazzaq al Badr [Video|Ar-En]",
    "author": "Shaykh ‘Abdurrazzaq al Badr",
    "translator": "",
    "category": "Dua - Supplication, Great Rewards, Video",
    "content": "Immense reward for Seeking Forgiveness For Every Believer – Shaykh ‘Abdurrazzaq al Badr حفظهما الله\n\nhttps://youtu.be/8uQ6QJQXA6c\n\n[2 min]\n\n‘Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said,:\n\n“Whoever seeks forgiveness for the believing men and women, Allah will record a good deed for him by each man and woman.”\n\nSource: Musnad al-Shāmīyīn 2118\n\nGrade: Jayyid (very good) according to Al-Haythami\n\nعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنِ اسْتَغْفَرَ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ كَتَبَ اللَّهُ لَهُ بِكُلِّ مُؤْمِنٍ وَمُؤْمِنَةٍ حَسَنَةً\n\n2118 مسند الشاميين للطبراني\n\n10/213 المحدث الهيثمي خلاصة حكم المحدث إسناده جيد في مجمع الزوائد\n\nVisit the below links and learn the two supplications mentioned in the above video:\n\nOur Lord! Forgive me and my parents, and the believers on the Day of Reckoning\n\nhttps://authentic-dua.com/2011/12/02/our-lord-forgive-me-and-my-parents-and-the-believers-on-the-day-of-reckoning/\n\nNooh (Alahis Salaam) du’aa : My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women:\n\nhttps://muslimfortress.wordpress.com/2011/12/02/2011/11/29/my-lord-forgive-me-and-my-parents-and-all-the-believing-men-and-women/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/13/immense-reward-of-seeking-forgiveness-for-every-believer/",
    "language": "en"
  },
  {
    "title": "The Reality of the Call of Shaykh Muhammad ibn Abdulwahhab – Shaykh Saleh al Fawzan [Video|Ar-En]",
    "author": "The Reality of the Call of Shaykh Muhammad ibn Abdulwahhab",
    "translator": "",
    "category": "Dawah, Scholars, Scholars Biographies, Video",
    "content": "The Reality of the Call of Shaykh Muhammad ibn Abdulwahhab – Shaykh Saleh al Fawzan [Video|Ar-En]\n\nhttps://youtu.be/sj03mfnVK9A\n\n[40 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/21/the-reality-of-the-call-of-shaykh-muhammad-ibn-abdulwahhab/",
    "language": "en"
  },
  {
    "title": "Contemplating Over Sūrah al ‘Asr – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]",
    "author": "Shaykh Sulaymān al Ruhaylī",
    "translator": "",
    "category": "Deeds, Iman (Faith), Tafseer ul Qur'an, Time",
    "content": "Contemplating Over Sūrah al ‘Asr – Shaykh Sulaymān al Ruhaylī [Video|Ar-En Subtitles]\n\nhttps://youtu.be/YomaOoqSFFk\n\n[26 min] [Arabic|English Subtitles]\n\nExtremely Beneficial video. Try your best to benefit from it and share it with your friends and family.\n\nShaykh Sulaymān al Ruhaylī حفظه الله\n\nhttps://abdurrahman.org/tag/shaykh-sulaymaan-ar-ruhaylee/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1\n\nJoin our telegram channel:\n\nhttps://t.me/abdurrahmanorg",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/11/24/contemplating-over-surah-al-asr/",
    "language": "en"
  },
  {
    "title": "Lowering the Gaze – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En Subtitles]",
    "author": "Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Islam, Private Parts, Sins, Video",
    "content": "Lowering the Gaze – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En Subtitles]\n\nhttps://youtu.be/SaIaqyrv0yo\n\n[8 min]\n\nThe first thing we will do on the day of Eid is to lower our gaze\n\nShaykh Abdurrazaaq crying and grieving for the youth that struggles to lower their gaze – Emotional !!\n\nBy Allāh! These Cell Phones are a Calamity\n\n– Shaykh Abdurrazzāq al Badr [Video|Ar-En Subtitles]\n\nAre Adultery and Fornication the Only Types of Zinaa ?\n\n– Shaykh Ahmad ‘Umar Bazmool [Audio|Ar-En]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/20/lowering-the-gaze/",
    "language": "en"
  },
  {
    "title": "The Concise but Sufficient Advice of Ibn Taymiyyah – Shaykh Abdurrazzāq al Badr [Video|Ar-En Subtitles]",
    "author": "Shaykh Abdurrazzāq al Badr",
    "translator": "",
    "category": "Islam",
    "content": "The Concise but Sufficient Advice of Ibn Taymiyyah – Shaykh Abdurrazzāq al Badr [Video|Ar-En Subtitles]\n\nhttps://youtu.be/0Evz6FiJ5qY\n\n[6 min]",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/01/08/the-concise-but-sufficient-advice-of-ibn-taymiyyah/",
    "language": "en"
  },
  {
    "title": "The Shaykh Has Come to Lead Us In The Eclipse Prayer – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En]",
    "author": "The Shaykh Has Come to Lead Us In The Eclipse Prayer",
    "translator": "",
    "category": "Salah (Prayer)",
    "content": "The Shaykh Has Come to Lead Us In The Eclipse Prayer – Shaykh ‘Abdurrazzāq al Badr\n\n[4 min] [Arabic|English subtitles]\n\nhttps://youtu.be/-j2pZUswerE\n\nSalat-ul-Kusuf (Prayer on a solar eclipse) and Salat-ul-Khusuf (Prayer on a lunar eclipse) – alifta.com\n\nhttps://abdurrahman.org/2014/01/21/salat-ul-kusuf-eclipse-prayer/\n\nDo Not Belittle the Importance of the Eclipse – Dawud Adib [Audio|En]\n\nhttps://abdurrahman.org/2015/03/19/do-not-belittle-the-importance-of-the-eclipse-dawud-adib/",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/24/the-shaykh-has-come-to-lead-us-in-the-eclipse-prayer/",
    "language": "en"
  },
  {
    "title": "The Pillars of Gratitude – by Shaykh Sāleh al Fawzān [Video|Ar-En Subtitles]",
    "author": "by Shaykh Sāleh al Fawzān",
    "translator": "",
    "category": "Gratitude - Shukr - Thanking, Video",
    "content": "The Pillars of Gratitude – by Shaykh Sāleh al Fawzān [Video|Ar-En Subtitles]\n\nhttps://youtu.be/_f95ur-ihys\n\n[8 min]\n\nGratitude – Shukr – Thanking\n\nhttps://abdurrahman.org/category/islam/gratitude-shukr-thanking\n\nShaykh Saalih Fawzaan\n\nhttps://abdurrahman.org/tag/shaykh-saalih-fawzaan/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/14/the-pillars-of-gratitude/",
    "language": "en"
  },
  {
    "title": "The ‘Good Character’ of the Disbelievers – by Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En Subtitles]",
    "author": "by Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Kufr (Disbelief), Manners & Character",
    "content": "The ‘Good Character’ of the Disbelievers – by Shaykh ‘Abdurrazzāq al Badr\n\nhttps://youtu.be/YJqtBfTfI_g\n\n[5 min] [Arabic|English Subtitles]\n\nCharacter:\n\nhttps://abdurrahman.org/character/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/28/the-good-character-of-the-disbelievers/",
    "language": "en"
  },
  {
    "title": "Six Points Regarding Sha’ban – Shaykh al ‘Uthaymin [Video|Ar-En subtitles]",
    "author": "Shaykh al ‘Uthaymin",
    "translator": "",
    "category": "Islam, Shaban Month, Video",
    "content": "Six Points Regarding Sha’ban – Shaykh al ‘Uthaymin [Video|Ar-En subtitles]\n\nhttps://youtu.be/E5rpk6DpEOE\n\n[5 min]\n\nThe Month of Sha’ban:\n\nhttps://abdurrahman.org/category/islam/shaban-month/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/02/24/six-points-regarding-shaban/",
    "language": "en"
  },
  {
    "title": "From the Tremendous Signs of a Sound Heart during the Prayer – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]",
    "author": "Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Heart, Salah (Prayer), Video",
    "content": "From the Tremendous Signs of a Sound Heart during the Prayer – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]\n\nhttps://youtu.be/0OS1MXvQ_Nc\n\n[3 min]\n\nAs-Salah (The Prayer):\n\nhttps://abdurrahman.org/salah/\n\nShaykh ‘Abdurrazzāq al Badr حفظه الله :\n\nhttps://abdurrahman.org/tag/shaykh-abdur-razzaaq-ibn-abdul-muhsin/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/18/from-the-tremendous-signs-of-a-sound-heart-during-the-prayer/",
    "language": "en"
  },
  {
    "title": "Why the People of Madinah Don’t Celebrate the Mawlid (Milad-un-Nabi)? – by Shaykh ‘Abdurrazzāq al Badr حفظه الله [Ar|Eng Subtitles]",
    "author": "by Shaykh ‘Abdurrazzāq al Badr حفظه الله",
    "translator": "",
    "category": ".Our Prophet, Mawlid (Milad an-Nabi), Video",
    "content": "Why the People of Madinah Don’t Celebrate the Mawlid (Milad-un-Nabi)? – by Shaykh ‘Abdurrazzāq al Badr حفظه الله\n\nhttps://youtu.be/icgRwqKsc3A\n\n[11 min]\n\nMawlid (Milad an-Nabi)\n\nhttps://abdurrahman.org/category/islam/mawlid-milad-an-nabi/\n\nBid’ah (Innovation in the Religion)\n\nhttps://abdurrahman.org/innovation/\n\n[ Prophet Muhammad ﷺ ]\n\nhttps://abdurrahman.org/muhammad/\n\nShaykh ‘Abdurrazzāq al Badr حفظه الله :\n\nhttps://abdurrahman.org/tag/shaykh-abdur-razzaaq-ibn-abdul-muhsin/\n\nSubscribe to our Youtube channel for regular updates:\n\nhttps://www.youtube.com/c/AbdurRahmanMeda?sub_confirmation=1",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/09/30/why-the-people-of-madinah-do-not-celebrate-the-mawlid-milad-un-nabi/",
    "language": "en"
  },
  {
    "title": "What Has Been Revealed To Your Companion? – by Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]",
    "author": "by Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": ".Our Prophet, Islam, Seerah (Biography), Video",
    "content": "What Has Been Revealed To Your Companion? – by Shaykh ‘Abdurrazzāq al Badr\n\nhttps://youtu.be/F4x30shHhn4\n\n[2 min]\n\n[ Prophet Muhammad ﷺ ]\n\nhttps://abdurrahman.org/muhammad/",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/10/02/what-has-been-revealed-to-your-companion/",
    "language": "en"
  },
  {
    "title": "The Angel that Carries the Throne – by Shaykh ‘Abdurrazzāq al Badr حفظه الله [Video|Ar-En]",
    "author": "by Shaykh ‘Abdurrazzāq al Badr حفظه الله",
    "translator": "",
    "category": "Angels, Video",
    "content": "The Angel that Carries the Throne – by Shaykh ‘Abdurrazzāq al Badr حفظه الله\n\nhttps://youtu.be/9sH8lladrlc\n\n[2 min]\n\nBelief in Angels :\n\nhttps://abdurrahman.org/Angels\n\nShaykh ‘Abdurrazzāq al Badr حفظه الله :\n\nhttps://abdurrahman.org/tag/shaykh-abdur-razzaaq-ibn-abdul-muhsin/",
    "references": [],
    "source_url": "https://abdurrahman.org/2022/09/29/the-angel-that-carries-the-throne/",
    "language": "en"
  },
  {
    "title": "Welcoming Ramadhān – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]",
    "author": "Shaykh ‘Abdurrazzāq al Badr",
    "translator": "",
    "category": "Islam, Ramadhan",
    "content": "Welcoming Ramadhān – Shaykh ‘Abdurrazzāq al Badr [Video|Ar-En subtitles]\n\nhttps://youtu.be/vwa5NHcesZQ\n\n[14 min]\n\nRamadhan (Main Page):\n\nhttps://abdurrahman.org/ramadhan/",
    "references": [],
    "source_url": "https://abdurrahman.org/2023/03/20/welcoming-ramadhan/",
    "language": "en"
  }
]